package hw_6_data_structure_selection_algorithm;

public class Main {
    /*
        1. Хранение уникальных идентификаторов пользователей
        Решение: Использовать множество, так как оно гарантирует уникальность элементов и поддерживает быстрый доступ.

        2. Очередь задач для обработки
        Решение: Использовать очередь, так как она поддерживает модель FIFO.

        3. Хранение ключей и значений
        Решение: Использовать словарь, так как он поддерживает хранение данных в виде пар "ключ-значение".

        4. Иерархия сотрудников компании
        Решение: Использовать дерево, так как оно поддерживает иерархическую структуру.

        5. Поиск элементов по приоритету
        Решение: Использовать кучу, так как она поддерживает работу с приоритетами.

        6. Управление друзьями пользователя
        Решение: Использовать граф, так как он поддерживает хранение элементов и их связей.

        7. Упорядоченный список
        Решение: Использовать дерево, так как оно поддерживает быстрый поиск и сортировку.

        8. Учет посещений страниц
        Решение 1: Если отслеживать уникальные посещения, то нужно использовать множество,
            так как оно гарантирует уникальность элементов.
        Решение 2: Если вести подсчёт общего числа посещений, то нужно использовать хэш-таблицу,
            так как она имеет эффективный доступ к данным по ключу с использованием хэш-функции.

        9. История действий пользователя
        Решение: Использовать стек, так как он поддерживает модель LIFO.

        10. Структура телефонной книги
        Решение: Использовать хэш-таблицу, так как она имеет эффективный доступ к данным по ключу
            с использованием хэш-функции.

        11. Проверка корректности скобочной последовательности
        Решение: Использовать стек, так как он поддерживает модель LIFO.

        12. Хранение объектов с частым доступом
        Решение: Использовать массив, так как он имеет фиксированный размер и поддерживает быстрый доступ по индексу.

        13. Уникальные слова в тексте
        Решение: Использовать множество, так как оно гарантирует уникальность элементов.

        14. Структура электронной очереди
        Решение: Использовать очередь, так как она поддерживает модель FIFO.
    */
}
